import airConditionIconImg from "../../../assets/images/air_condition_icon.png";
import extractIconImg from "../../../assets/images/extract_icon.png";
import faucetIconImg from "../../../assets/images/faucet_icon.png";
import washingMachineIconImg from "../../../assets/images/washing_machine_icon.png";
import windowIconImg from "../../../assets/images/window_icon.png";
import cleaningIconImg from "../../../assets/images/cleaning.png";
import coolerIconImg from "../../../assets/images/cooler.png";

export const APPLIANCES = {
  washing_machine: {
    id: 'washing_machine',
    name: 'Пральна машина',
    icon: washingMachineIconImg,
    intervalDays: 90,
    steps: [
      { title: 'Сервісна чистка', desc: 'Раз на 2–3 місяці відкручувати зливний фільтр (внизу корпусу) і видаляти сміття.' },
      { title: 'Догляд за манжетою', desc: 'Після кожного прання протирати гумовий ущільнювач насухо та залишати дверцята відчиненими.' },
      { title: 'Термічна обробка', desc: 'Раз на місяць запуск циклу «Бавовна 90°C» без білизни для повної дезінфекції бака.' }
    ]
  },
  extract: {
    id: 'extract',
    name: 'Витяжка',
    icon: extractIconImg,
    intervalDays: 60,
    steps: [
      { title: 'Регулярне миття', desc: 'Раз на місяць знімати сітки та замочувати їх у лужному розчині (антижир) або мити у посудомийній машині на високій температурі.' },
      { title: 'Контроль вугільних фільтрів', desc: 'Якщо витяжка без відводу в шахту — заміна вугільних касет кожні 4–6 місяців.' }
    ]
  },
  air_condition: {
    id: 'air_condition',
    name: 'Кондиціонер',
    icon: airConditionIconImg,
    intervalDays: 14,
    steps: [
      { title: 'Чистка фільтрів', desc: 'Промивати пластикові сітки під проточною водою.' },
      { title: 'Дезінфекція', desc: 'Обробляти теплообмінник (ребра під фільтрами) спеціальним антисептичним спреєм.' },
      { title: 'Режим просушування', desc: 'Після використання охолодження вмикайте режим вентилятора на 10 хв, щоб видалити конденсат.' }
    ]
  },
  window: {
    id: 'window',
    name: 'Вікна',
    icon: windowIconImg,
    intervalDays: 180,
    steps: [
      { title: 'Сезонне регулювання', desc: 'Переведення ексцентриків у літній режим (слабкий притиск), щоб дати гумі «відпочити», та зимовий (щільний), щоб уникнути втрат тепла.' },
      { title: 'Змащування', desc: 'Раз на рік обробляти гуму силіконовою змазкою, а рухомі металеві частини — машинним маслом.' }
    ]
  },
  faucet: {
    id: 'faucet',
    name: 'Кран',
    icon: faucetIconImg,
    intervalDays: 30,
    steps: [
      { title: 'Хімічна чистка', desc: 'Раз на пів року відкрутити аератор і занурити у розчин лимонної кислоти або оцту на 1 годину.' },
      { title: 'Механічна чистка', desc: 'Промити внутрішні сітки під сильним тиском води у зворотному напрямку.' }
    ]
  },
  room_cleaning: {
    id: 'room_cleaning',
    name: 'Прибирання кімнати',
    icon: cleaningIconImg,
    intervalDays: 7,
    steps: [
        { title: 'Сухе прибирання', desc: 'Раз на тиждень пилососити підлогу, килими та плінтуси. Особливу увагу приділяти кутам і простору під ліжком.' },
        { title: 'Вологе прибирання', desc: 'Протирати підлогу вологою ганчіркою або шваброю з м’яким миючим засобом.' },
        { title: 'Витирання пилу', desc: 'Протирати горизонтальні поверхні (стіл, полиці, підвіконня) мікрофіброю.' },
        { title: 'Провітрювання', desc: 'Щодня провітрювати кімнату 10–15 хвилин для оновлення повітря.' }
    ]
  },
  cooler: {
    id: 'cooler',
    name: 'Холодильник',
    icon: coolerIconImg,
    intervalDays: 60,
    steps: [
        { title: 'Очищення полиць', desc: 'Виймати полиці та ящики, мити їх теплою водою з м’яким миючим засобом і повністю висушувати перед встановленням.' },
        { title: 'Перевірка продуктів', desc: 'Щотижня переглядати вміст холодильника та викидати прострочені або зіпсовані продукти.' },
        { title: 'Розморожування', desc: 'Розморожувати при утворенні шару льоду більше 5 мм. Це економить електроенергію та покращує роботу холодильника' },
        { title: 'Чистка конденсатора', desc: 'Очищати задню решітку від пилу пилососом або сухою щіткою.'}
    ]
  }
};