import plumberImg from "../../../assets/images/plumber.png";
import electricianImg from "../../../assets/images/electrician.png";
import helmetImg from "../../../assets/images/helmet.png";
import toolsImg from "../../../assets/images/tools.png";
import checklistImg from "../../../assets/images/checklist.png";

import { 
    CardsGridElectrician,
    TextCard, 
    TextCardYellow,
    Media,
    Image,
    IconImage, 
    InfoTitle, 
    InfoText, 
    GreyBlock,  
    NoteBox, 
    CardHeader
} from "../RepairsPage.styled";

export default function ElectricianSection(){
    return(
        <>
            <CardsGridElectrician>
                <TextCard area="leftTop">
                        <GreyBlock>
                            <Media>
                                <InfoTitle>Електрик</InfoTitle>
                                <Image>
                                    <img src={electricianImg} alt="Електрик" />
                                </Image>
                            </Media>
                            <InfoText>Тут є важливий нюанс. Не всі електрики однакові. Тобі треба розуміти, кого шукати, щоб не переплачувати і отримати результат.</InfoText>
                        </GreyBlock>
                </TextCard>

                <TextCardYellow area="leftLeft">
                    <InfoTitle>Електромонтажник</InfoTitle>
                    <GreyBlock>
                        <InfoText>Це будівельник, людина, яка робить все з нуля. Він проводить електропровід і підключає обладнання по готовим схемам.</InfoText>
                    </GreyBlock>
                </TextCardYellow>

                <TextCardYellow area="Mid">
                    <InfoTitle>Електромонтер</InfoTitle>
                    <GreyBlock>
                        <InfoText>Це схемотехнік, людина, яка обслуговує та ремонтує те, що вже є. Твій "швидкий помічник".</InfoText>
                    </GreyBlock>
                </TextCardYellow>

                <TextCard area="leftMid">
                    <GreyBlock>
                        <IconImage><img src={helmetImg} alt="Електромонтажер"/><InfoTitle>Коли кликати електромонтажника: </InfoTitle></IconImage>
                    </GreyBlock>
                    <InfoText>
                        Ти робиш ремонт і треба прокласти нову проводку у стінах.<br></br><br></br>
                        Треба перенести розетки в інше місце (штробити стіни).<br></br><br></br>
                        Потрібно зібрати щиток з автоматами "з нуля".<br></br><br></br>
                        Підключення потужної техніки (електроплита, бойлер) окремою лінією від щитка.<br></br>
                    </InfoText>
                </TextCard>

                <TextCard area="leftBottom">
                    <GreyBlock>
                        <IconImage><img src={toolsImg} alt="Електромонтера"/><InfoTitle>Коли кликати електромонтера: </InfoTitle></IconImage>
                    </GreyBlock>
                    <InfoText>
                        Зникло світло в одній кімнаті або у всій квартирі (а у сусідів є).<br></br><br></br>
                        Розетка вивалилася зі стіни або "тріщить".<br></br><br></br>
                        Вибиває "пробки" (автомати), коли наприклад вмикаєш чайник.<br></br><br></br>
                        Треба замінити люстру, вимикач або полагодити існуючу розетку.<br></br>
                    </InfoText>
                </TextCard>

                <TextCard area="rightTop">
                        <GreyBlock>
                            <Media>
                                <InfoTitle>Сантехнік</InfoTitle>
                                <Image>
                                    <img src={plumberImg} alt="Сантехнік" />
                                </Image>
                            </Media>
                            <InfoText>Сантехнік займається всім, що пов'язано з водою, каналізацією та опаленням. Вода — це стихія, яка нищить ремонт за хвилини, тому тут швидкість вирішує все.</InfoText>
                        </GreyBlock>
                </TextCard>

                <TextCard area="rightMid">
                    <CardHeader>
                        <InfoTitle>🚨 ТЕРМІНОВО викликай сантехніка, якщо:</InfoTitle>
                    </CardHeader>
                    <InfoText>
                        1. <strong>Фонтан з труби:</strong> Вода б’є під тиском, і ти не можеш це зупинити.<br></br><br></br>
                        2. <strong>Каналізація йде назад:</strong> Вода в унітазі чи ванній піднімається вгору, замість того щоб стікати (особливо, якщо це супроводжується "ароматами").<br></br><br></br>
                        3. <strong>Прорив батареї:</strong> З радіатора тече гаряча вода (обережно, це опіки!).<br></br><br></br>
                        4. <strong>Мокрі плями на стелі:</strong> Або ти топиш, або топлять тебе.<br></br>
                    </InfoText>
                </TextCard>

                <NoteBox area="rightMid2">
                    <strong>💡Порада</strong>
                    <InfoText><br></br>Поки їде майстер, знайди ввідний кран (зазвичай у туалеті або ванній біля лічильників) і перекрий його. Це перше, що ти маєш знати у новій квартирі!</InfoText>
                </NoteBox>

                <TextCard area="rightBottom">
                    <InfoTitle>Плановий виклик сантехніка (може почекати до завтра):</InfoTitle>
                    <GreyBlock>
                        <ul>
                            <li><strong>Кран капає або гуде:</strong> Це дратує і накручує лічильник, але не смертельно.</li>
                            <li><strong>Вода погано стікає:</strong> "Кріт" не допоміг, і вода стоїть у раковині по 10 хвилин.</li>
                            <li><strong>Підключення техніки:</strong> Ти купив пралку чи посудомийку. Не підключай навмання — зірвеш шланг, буде біда.</li>
                            <li><strong>Слабкий напір води:</strong> Коли душ ледве тече.</li>
                        </ul>
                    </GreyBlock>
                </TextCard>

                <TextCard area="Bottom1">
                    <IconImage><img src={checklistImg} alt="Чеклист"/><InfoTitle>Як говорити з майстром, про що повідомити в першу чергу:</InfoTitle></IconImage>
                    <GreyBlock>
                        <ul>
                            <li>Чітко опиши проблему. Не "щось зламалося", а "іскрить розетка на кухні, коли вмикаю чайник".</li>
                            <li>Зроби фото/відео. Надішли майстру в месенджер заздалегідь. Це зекономить час і дасть змогу оцінити вартість.</li>
                            <li>Запитай ціну ДО початку робіт.</li>
                            <li>Діагностика: Скільки коштує просто приїхати і подивитися?</li>
                            <li>Робота: Яка орієнтовна вартість ремонту?</li>
                            <li>Матеріали: Хто купує деталі? (Краще, щоб купував майстер, але надав чек).</li>
                            <li>Підготуй простір. Прибери зайві речі, звільни доступ до труби чи розетки, закрий кота в іншій кімнаті.</li>
                        </ul>
                    </GreyBlock>
                </TextCard>

                <TextCard area="Bottom2">
                    <CardHeader>
                        <InfoTitle>⚡️ТЕРМІНОВО вимикай рубильник і дзвони електрику, якщо:</InfoTitle>
                    </CardHeader>
                    <InfoText>
                        <strong>Запах горілого пластику:</strong> Особливо біля розеток чи щитка.<br></br><br></br>
                        <strong>Іскри:</strong> З вимикача чи розетки летять іскри при використанні.<br></br><br></br>
                        <strong>Мерехтіння світла:</strong> Лампочки блимають, як у фільмі жахів (це ознака поганого контакту, що веде до пожежі).<br></br><br></br>
                        <strong>Б’є струмом:</strong> Від корпусу пралки, холодильника чи мікрохвильовки "щипає" пальці. Це смертельно небезпечно!<br></br>
                    </InfoText>
                </TextCard>
            </CardsGridElectrician>
        </>
    );
}