import breakerImg from "../../../assets/images/breaker.jpg";
import brokenSocketImg from "../../../assets/images/broken-socket.jpg";
import cloggedDrainImg from "../../../assets/images/clogged-drain.jpg";
import dirtyWaterImg from "../../../assets/images/dirty-water.jpg";
import heatingProblemsImg from "../../../assets/images/heating-problems.jpg";
import noElectricityImg from "../../../assets/images/no-electricity.jpg";
import shortCircuitImg from "../../../assets/images/short-circuit.jpg";
import smellOfGasImg from "../../../assets/images/smell-of-gas.jpg";
import waterKeakageImg from "../../../assets/images/water-keakage.jpg";

import { 
    Row, 
    Media, 
    InfoTitle, 
    Image, 
    TextCard, 
    InfoText 
} from "../RepairsPage.styled";

export default function ProblemsSection() {
    
    return(
        <>
            <Row>
                <Media>
                <InfoTitle>Знеструмлення</InfoTitle>
                <Image>
                    <img src={noElectricityImg} alt="Знеструмлення" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Перевірте, чи немає світла у сусідів – це допоможе зрозуміти, чи проблема в будинку чи у всьому районі.<br /><br />
                    2. Подивіться щиток – чи не вибив автомат.<br /><br />
                    3. Включіть запасне освітлення: ліхтарик, павербанк, свічки (обережно – далеко від паперу та одягу).<br /><br />
                    4. Відключіть важливу техніку: холодильник, комп’ютер, телевізор – щоб уникнути стрибків напруги при поверненні світла.<br /><br />
                    5. Слідкуйте за повідомленнями від електропостачальної компанії (Telegram, сайт, Viber).
                </InfoText>
                </TextCard>
            </Row>

            <Row reverse>
                <Media>
                <InfoTitle>Вибило автомат</InfoTitle>
                <Image>
                    <img src={breakerImg} alt="Вибило автомат" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    <strong>Автомат</strong> — це пристрій у електрощитку, який захищає проводку та техніку від перевантаження або короткого замикання. Простіше: це “запобіжник”, який сам вимикає електрику, коли виникає небезпека.<br /><br />
                    1. Не вмикайте автомат повторно багато разів без перевірки.<br /><br />
                    2. Відключіть усі прилади в у домі.<br /><br />
                    3. Спробуйте увімкнути автомат – якщо знову вибило → викликайте електрика.
                </InfoText>
                </TextCard>
            </Row>

            <Row>
                <Media>
                <InfoTitle>Запах газу</InfoTitle>
                <Image>
                    <img src={smellOfGasImg} alt="Газ" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Не вмикайте світло, не запалюйте сірники, не вмикайте електроприлади – будь-яка іскра може спричинити вибух.<br /><br />
                    2. Перекрий газ (кран на плиті або загальний).<br /><br />
                    3. Відкрийте всі вікна та двері для провітрювання.<br /><br />
                    4. Негайно вийдіть із приміщення та не залишайтеся в квартирі до приїзду аварійної служби. Викличте аварійну газову службу за номером 104.<br /><br />
                    5. Не намагайтеся самостійно ремонтувати труби чи прилади.
                </InfoText>
                </TextCard>
            </Row>

            <Row reverse>
                <Media>
                <InfoTitle>Протікання води</InfoTitle>
                <Image>
                    <img src={waterKeakageImg} alt="Протікає вода" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Негайно перекрийте воду у квартирі або на стояку.<br /><br />
                    2. Попередьте сусідів, якщо вода може затопити їхні квартири.<br /><br />
                    3. З’ясуй джерело (кран, труба, бачок), оглянь наявність тріщин, іржі, ослаблених з’єднань. <br /><br />
                    4. Відсуньте від місця протікання меблі та техніку, використовуйте ганчірки або тазики для збору води.<br /><br />
                    5. Викличте сантехніка або комунальну службу відповідно до вашого міста.
                </InfoText>
                </TextCard>
            </Row>

            <Row>
                <Media>
                <InfoTitle>Несправна розетка</InfoTitle>
                <Image>
                    <img src={brokenSocketImg} alt="Несправна розетка" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Вимкніть живлення у щитку перед оглядом розетки.<br /><br />
                    2. Не користуйтеся розеткою, якщо вона іскрить, плавиться, смердить або нагрівається.<br /><br />
                    3. Викличте кваліфікованого електрика для заміни або ремонту. <br /><br />
                    4. Не підключайте одночасно багато потужних приладів через трійники або подовжувачі; не використовуйте розетки, які тріскаються або погано тримають вилку.
                </InfoText>
                </TextCard>
            </Row>

            <Row reverse>
                <Media>
                <InfoTitle>Проблеми з опаленням</InfoTitle>
                <Image>
                    <img src={heatingProblemsImg} alt="Проблеми з опаленням" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Подивіться, чи ввімкнений котел (на панелі має світитися лампочка або цифровий екран).<br /><br />
                    2. Переконайтеся, що він підключений до розетки або є подача газу (Якщо не впевнені, не відкривайте котел самостійно).<br /><br />
                    3. Пройдіться по кімнатах: батареї мають бути теплі на дотик. Якщо холодні можливо, повітря в системі або котел не працює. Не намагайтеся самі відкручувати крани або труби, якщо ніколи цього не робили.<br /><br />
                    4. Якщо опалення централізоване, дізнайся, чи підключене опалення в будинку: можливо, подача ще не включена або є аварія. Звернися у ЖЕК або на гарячу лінію теплокомуненерго.<br /><br />
                    5. Якщо котел не запускається або батареї холодні → викликайте професіонала.<br /><br />
                    6. Використовуйте обігрівачі або грілки. Закривайте штори, накривайте диван та ліжко ковдрами, щоб мінімізувати втрати тепла. Закрий двері та щілини, щоб тепло не виходило.
                </InfoText>
                </TextCard>
            </Row>

            <Row>
                <Media>
                <InfoTitle>Коротке замикання</InfoTitle>
                <Image>
                    <img src={shortCircuitImg} alt="Коротке замикання" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Відразу вимкніть живлення у щитку.<br /><br />
                    2. Не торкайтеся пошкоджених проводів, іскрящихся приладів чи розеток. Не гасіть іскри чи дроти водою. Вода - це провідник електрики!<br /><br />
                    3. Викличте кваліфікованого електрика. Перевіряйте стан проводки і не накривайте дроти ковдрами чи тканинами.<br /><br />
                    4. Якщо є маленький вогонь у приладі, спробуй засипати його змемлею з горщика або сіллю. Якщо вогонь хоч трохи виходить із під контролю негайно телефонуй у пожежнну службу 101.
                </InfoText>
                </TextCard>
            </Row>

            <Row reverse>
                <Media>
                <InfoTitle>Засмічена каналізація</InfoTitle>
                <Image>
                    <img src={cloggedDrainImg} alt="Засмічена каналізація" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Не заливайте воду у забиту трубу – ризик затоплення.<br /><br />
                    2. Спробуйте прочистити вантузом, сантехнічним тросом або засобом для прочистки труб (тільки якщо впевнені у своїх силах).<br /><br />
                    3. Якщо проблема не вирішена – викличте сантехніка.<br /><br />
                    4. Не зливайте жир, залишки їжі, пакети, серветки та ватні диски у каналізацію. Бажано мати сітку для волосся у ванні та раз на місяць промивати труби оцтом з содою.
                </InfoText>
                </TextCard>
            </Row>

            <Row>
                <Media>
                <InfoTitle>Наявність осаду або ржавчини у воді</InfoTitle>
                <Image>
                    <img src={dirtyWaterImg} alt="Наявність осаду у воді" />
                </Image>
                </Media>

                <TextCard as="div">
                <InfoText>
                    1. Не використовуйте воду для пиття та приготування їжі, поки не перевірите якість. Використовуйте бутильовану воду або перевірені фільтри.<br /><br />
                    2. Відкрийте кран холодної та гарячої води в кількох точках квартири. Якщо осад є тільки у гарячій воді, проблема може бути у бойлері або водонагрівачі. Якщо осад є у всіх кранах, причина, ймовірно, у трубах у будинку або у міському водопроводі.<br /><br />
                    3. Якщо осад постійно з’являється, зверніться до водоканалу або місцевого ЖЕКу, бо це може бути ознакою: старих або іржавих труб у будинку, ремонтних робіт у водопроводі, підвищеного вмісту заліза у воді.<br /><br />
                    4. Якщо проблема в будинку, можна спробувати промити систему водопостачання: відкрити всі крани на кілька хвилин, щоб вода змусила осад піти.
                </InfoText>
                </TextCard>
            </Row>
        </>
    );
}