import checklistImg from "../../../assets/images/checklist.png";
import fireImg from "../../../assets/images/fire.png";
import forkImg from "../../../assets/images/fork.png";
import ideaImg from "../../../assets/images/idea.png";
import shieldImg from "../../../assets/images/shield.png";
import tapImg from "../../../assets/images/tap.png";

import { 
    CardsGridSafety,
    TextCard, 
    IconImage, 
    InfoTitle, 
    InfoText, 
    GreyBlocksRow, 
    GreyBlockColumn, 
    GreyBlock, 
    GreyText, 
    NoteBox 
} from "../RepairsPage.styled";

export default function SafetySection(){
    return(
        <CardsGridSafety>
            <TextCard area="leftTop">
            <IconImage><img src={shieldImg} alt="<Безпека>"/><InfoTitle>Інструкція з безпеки</InfoTitle></IconImage>
            <InfoText>Ці поради допоможуть зберегти здоров’я, майно і нерви у повсякденному житті. Не ігноруй дрібниці - саме вони найчастіше стають причиною проблем.</InfoText>
            </TextCard>

            <TextCard area="leftMid"> 
            <InfoTitle>Дотримуйся правила:</InfoTitle> 
            <InfoText>Якщо щось у домі поводиться “дивно” - це вже причина перевірити.</InfoText>
            </TextCard>

            <TextCard area="main">
            <GreyBlocksRow>
                <GreyBlockColumn>
                <IconImage><img src={forkImg} alt="Електрика" /></IconImage>
                <ul>
                    <li>Не перевантажуй розетку кількома потужними приладами;</li>
                    <li>Якщо пропало світло, вимкни електроприлади з мережі, перед поверненням;</li>
                    <li>Вимикай прилади з розетки, якщо їдеш з дому;</li>
                    <li>Зарядка в розетці без телефону - не норма!</li>
                </ul>
                </GreyBlockColumn>
                <GreyBlockColumn>
                <IconImage><img src={tapImg} alt="Сантехніка" /></IconImage>
                <ul>
                    <li>Перекривай воду, коли йдеш із дому;</li>
                    <li>Не зливай у раковину жир, серветки, сторонні предмети;</li>
                    <li>Пральну машину не варто залишати працювати, коли нікого нема;</li>
                    <li>Капає з крана? Це не дрібниця. Може спричинити різкий прорив.</li>
                </ul>
                </GreyBlockColumn>
                <GreyBlockColumn>
                <IconImage><img src={fireImg} alt="Вогонь або газ" /></IconImage>
                <ul>
                    <li>Завжди перевіряй, чи вимкнена газова плита;</li>
                    <li>Не залишай їжу на вогні без нагляду;</li>
                    <li>Не використовуй плиту для обігріву кімнати;</li>
                    <li>У разі запаху газу: не вмикай світло, відкрий вікна, вийди з приміщення.</li>
                </ul>
                </GreyBlockColumn>
            </GreyBlocksRow>
            </TextCard>

            <TextCard area="right">
            <IconImage><img src={checklistImg} alt="<Чеклист>"/><InfoTitle>Чеклист безпечного дому</InfoTitle></IconImage>
            <GreyBlock>
                <GreyText>
                <InfoText>
                    1. Є укомплектована аптечка в доступному місці;<br /><br />
                    2. Знаю і можу швидко перекрити всі комунікації (вода, газ, електрика);<br /><br />
                    3. Орієнтуюсь у електрощитку та знаю головний автомат;<br /><br />
                    4. Вентиляція відкрита й працює;<br /><br />
                    5. Потужні пристрої (обігрівач, бойлер, пралка) увімкнені напряму в стіну, а не в трійник;
                </InfoText>
                </GreyText>
            </GreyBlock>
            </TextCard>

            <NoteBox area="bottom">
            <strong>💡Примітка</strong>
            <IconImage>
                <img src={ideaImg}/>
                <InfoText> Будь пильним! Профілактика дешевша за ремонт. Не ігноруй дрібні несправності. Краще виправити дрібницю зараз, ніж створити більшу проблему пізніше.</InfoText>
            </IconImage>
            </NoteBox>
        </CardsGridSafety>
    );
}